# Pandas

## Series object in one-dimensional labeled array

In [23]:
import pandas as pd

In [24]:
s1 = pd.Series([1,2,3,4,5])

In [25]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [26]:
type(s1)

pandas.core.series.Series

series can be indexed and change to its value

In [27]:
s2 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

# We can also create a series object from a dict

In [8]:
s3 = pd.Series({'a':10,'b':20,'c':40})
s3

a    10
b    20
c    40
dtype: int64

# We can change the index position

In [9]:
pd.Series({'a':10,'b':20,'c':30},index=['b','c','d','a'])

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

# Dataframe

In [ ]:
df1 = pd.DataFrame({'Name':['Thomas','Krishom',"Abish","Nabin","Pankaj","Bijay","Krinesh","Anup","Supreme","Hemraj"],
                    "Marks":[11,22,33,44,55,66,77,88,99,100],
                    "age":[33,44,11,22,33,20,33,45,32,18],
                    "Gender":["Male","Male","Female","Male","Male","Male","Male","Male","Male","Female"]})
df1.sample(10)

      Name  Marks  age  Gender
0   Thomas     11   33    Male
1  Krishom     22   44    Male
2    Abish     33   11  Female
3    Nabin     44   22    Male
4   Pankaj     55   33    Male
5    Bijay     66   20    Male
6  Krinesh     77   33    Male
7     Anup     88   45    Male
8  Supreme     99   32    Male
9   Hemraj    100   18  Female

## Saving datatsets into csv and xlsx

In [22]:
df1.to_csv('datasets/student.csv',index=False)
df1.to_excel('datasets/student.xlsx',index=False)

In [28]:
df1.shape

(10, 4)

In [29]:
df1.head()

      Name  Marks  age  Gender
0   Thomas     11   33    Male
1  Krishom     22   44    Male
2    Abish     33   11  Female
3    Nabin     44   22    Male
4   Pankaj     55   33    Male

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Marks   10 non-null     int64
 2   age     10 non-null     int64
 3   Gender  10 non-null     object
dtypes: int64(2), object(2)
memory usage: 452.0+ bytes

In [31]:
df1.describe()

            Marks        age
count   10.000000  10.000000
mean    59.500000  29.100000
std     31.767384  11.120052
min     11.000000  11.000000
25%     35.750000  20.500000
50%     60.500000  32.500000
75%     85.250000  33.000000
max    100.000000  45.000000